import { Modal } from "antd";
import scss from "./UserPolicy.module.scss";

export default function userPolicy() {
  Modal.info({
    width: 800,
    content: (
      <div className={scss.PolicyDiv}>
        <h2>Пользовательское соглашение</h2>
        <h3>Оферта и лицензионный договор</h3>
        <p>
          Настоящий Договор является официальным предложением (публичной
          офертой) от ИП Матронина Вячеслава Юрьевича (далее Лицензиар) выражает
          намерение заключить договор о предоставлении права пользования
          сервисом ITICRM, на изложенных ниже условиях.
        </p>
        <h3>Термины и определения</h3>
        <p>
          Акцепт оферты — полное и безоговорочное принятие Оферты путем
          совершения одного из действий: регистрация в качестве Пользователя,
          перечисление денежных средств в пользу Лицензиата, получение Лицензии.
        </p>
        <p>
          Доступность сервиса — процент времени без простоев сервиса за
          указанный период.
        </p>
        <p>
          Оператор — физическое лицо, непосредственно работающее с сайтом или
          программой.
        </p>
        <p>
          Оферта — настоящий документ «Оферта и Лицензионный договор»,
          размещенный в сети Интернет по адресу https://iticrm.net/oferta/.
        </p>
        <p>
          Пользователь — физическое или юридическое лицо, заключившее
          Лицензионный договор.
        </p>
        <p>
          Простой сервиса — неработоспособность одной или нескольких функций
          программного обеспечения.
        </p>
        <p>
          Сайт — сайт, размещенный в сети Интернет по адресу https://iticrm.net/.
        </p>
        <p>
          Лицензия на программное обеспечение — неисключительная лицензия на
          использование программного обеспечения, доступного через личный
          кабинет Пользователя на сайте https://iticrm.net/, в соответствии с
          тарифом.
        </p>
        <p>
          Тарифы — стоимость Лицензии на программное обеспечение, указанная на
          сайте https://iticrm.net/ в разделе «Тарифы».
        </p>
        <p>
          Программное обеспечение — сервис, доступный на сайте
          https://iticrm.net/, обеспечивающая автоматизированную обработку данных
          из систем, перечисленных на Сайте и обмен данными между этими
          системами в соответствии с настройкам, сделанным Пользователем.
        </p>
        <h3>1. Общие положения</h3>
        <p>
          1.1 Предметом Договора является предоставление Лицензии на программное
          обеспечение Пользователю.
        </p>
        <p>
          1.2 Лицензиар предоставляет Пользователю Лицензию на программное
          обеспечение согласно Тарифам и условиям Договора.
        </p>
        <p>
          1.3 Лицензиар вправе изменить Договор. Договор считается заключенным
          на новых условиях на третий день после публикации новой редакции
          Оферты, если Лицензиар не получил от Пользователя электронное письмо о
          расторжении Договора в трехдневный срок.
        </p>
        <p>
          1.4 Стоимость Лицензии на программное обеспечение определяется на
          основании действующих Тарифов Лицензиара. НДС не облагается.
        </p>
        <p>
          1.5 Программное обеспечение предоставляется Пользователю «как оно
          есть». Лицензиар не несет ответственности за неисполнение или
          ненадлежащее исполнение обязательств по Договору, а также за возможный
          ущерб, возникший для Пользователя.
        </p>
        <p>
          1.6 Договор является офертой в соответствии со ст. 435 ГК РФ, и в силу
          этого Лицензиар имеет право на отзыв Договора как оферты в
          соответствии со ст. 436 ГК РФ. Денежные средства подлежат возврату на
          основании оригиналов соответствующих писем о возврате денежных
          средств.
        </p>
        <p>
          1.7 Договор вступает в силу с момента акцепта настоящей оферты.
          Договор заключается на неопределенный срок и может быть расторгнут по
          инициативе любой из Сторон в любое время. В случае расторжения
          Договора по инициативе Пользователя денежные средства не возвращаются.
        </p>
        <p>
          1.8 Лицензиар вправе направлять ежемесячную рассылку и оповещения о
          критичных обновлениях сервиса на адрес электронной почты Пользователя.
          Пользователь вправе отказаться от ежемесячной рассылки, уведомив об
          этом Лицензиара по реквизитам, указанным в разделе «Реквизиты и
          подпись Лицензиара».
        </p>
        <p>
          1.9 Лицензиар отвечает на вопросы Пользователя, относящиеся к
          программному обеспечению и Сайту, в течение 4 рабочих дней, если
          Пользователь задал вопрос на email, указанный в реквизитах.
        </p>
        <h3>2. Регистрация на сайте</h3>
        <p>
          2.1 При регистрации на Сайте Пользователь указывает свой действующий
          адрес электронной почты, по которому с ним можно связаться. И
          актуализирует адрес, если он изменился.
        </p>
        <p>
          2.2 Если Пользователь указал несуществующий, не действующий или не
          принадлежащий ему адрес, Лицензиар вправе не предоставлять Лицензию на
          программное обеспечение.
        </p>
        <p>
          2.3 Если Пользователь приобретает несколько Лицензий на программное
          обеспечение, он вправе регистрироваться на Сайте соизмеримо количеству
          приобретенных Лицензий.
        </p>
        <h3>3. Лицензия на программное обеспечение</h3>
        <p>
          3.1 Лицензиар предоставляет Пользователю Лицензию на программное
          обеспечение в соответствии с оплаченным Тарифом.
        </p>
        <h3>4. Конфиденциальность</h3>
        <p>
          4.1 Лицензиар не передает третьим лицам, и не использует иным
          способом, не предусмотренным условиями договора, обрабатываемую
          информацию Пользователя.
        </p>
        <p>
          4.2 Пользователь, как обладатель обрабатываемой информации, принимает
          надлежащие меры к обеспечению ее конфиденциальности.
        </p>
        <p>
          4.3 Если в процессе оказания услуг обрабатываются персональные данные
          пользователей сети Интернет, ответственность на получение согласия
          субъекта персональных данных на их обработку лежит на операторе
          персональных данных.
        </p>
        <h3>5. Доступность</h3>
        <p>
          5.1 В случае, если Пользователь предъявил документально подтвержденные
          и признанные Лицензиаром доказательства того, что Пользователь не мог
          использовать программное обеспечение из-за неработоспособности Сайта,
          Лицензиар увеличивает срок действия Лицензии на программное
          обеспечение на период неработоспособности.
        </p>
        <h3>6. Порядок расчетов</h3>
        <p>
          6.1 Пользователь оплачивает стоимость Лицензии на программное
          обеспечение согласно Тарифам с помощью Платежного сервиса, либо
          безналичным банковским переводом на расчетный счет Лицензиара в валюте
          и по реквизитам, указанным в разделе «Реквизиты и подпись Лицензиара».
          НДС не облагается.
        </p>
        <p>6.2 Транзакции сверх Тарифа оплачиваются дополнительно.</p>
        <p>
          6.3 Списание денежных средств с баланса лицевого счета за превышение
          количества пользователей происходит в день оплаты Тарифа. При этом на
          балансе лицевого счета пользователя должны находиться денежные
          средства, соответствующие тарификации превышения лимита пользователей.
          Если на момент превышения на балансе лицевого счета нет денежных
          средств, необходимых для оплаты сверх лимита транзакций, то баланс
          уйдет в минус. Если в течении 3-х рабочих дней задолженность не будет
          погашена, работа сервиса будет приостановлена. Оплатить тариф будет
          невозможно, пока задолженность не будет погашена.
        </p>
        <p>
          6.4 По истечении срока действия Тарифа он автоматически продлевается
          на период, аналогичный предыдущему. Администрация осуществляет
          автоматическое списание соответствующей суммы с платежной карты
          Пользователя согласно действующим Тарифам.
        </p>
        <p>
          6.5 Пользователь вправе отменить функцию автоплатежа в любой момент на
          странице управления балансом https://iticrm.net/. Или уведомить
          Поддержку о нежелании продлевать платный Тариф не позднее чем за 2
          (два) дня до окончания срока его действия.
        </p>
        <p>
          6.6 При первой оплате Тарифа Пользователь дает Администрации и её
          партнёрам согласие на хранение информации о его платежной карте и
          соглашается с тем, что Администрация уполномочена взимать плату с
          платежной карты для:
        </p>
        <ol type="a">
          <li>реализации функции автоплатежа;</li>
          <li>списания иных платежей, связанных с Соглашением;</li>
          <li>погашения задолженности Пользователя по Соглашению.</li>
        </ol>
        <p>
          6.7 Обязательство Пользователя по оплате стоимости Лицензии на
          программное обеспечение считается выполненным с момента поступления
          денежных средств на расчетный счет Лицензиара.
        </p>
        <p>
          6.8 Факт оказания услуг подтверждается кассовым чеком и передаются
          Пользователю путем отправки на электронный ящик, который был указан
          при оплате. Акты и иные документы оформляются датой поступления
          средств на расчетный счет и передаются Пользователю.
        </p>
        <h3>7. Реквизиты и подпись Лицензиара</h3>
        <p>Индивидуальный предприниматель Матронин Вячеслав Юрьевич</p>
        <p>ИНН: 644914630283,</p>
        <p>ОГРНИП: 318645100055285.</p>
        <p>E-mail: support@iticrm.net</p>
        <p>Телефон: 8-968-381-78-88</p>
        <p>Юридический и почтовый адрес: 413113, Саратовская область,</p>
        <p>г. Энгельс, ул. Космонавтов, дом 14, кв. 5</p>
        <p>Реквизиты:</p>
        <p>р/с: 40802810700000612144</p>
        <p>
          в АО "ТИНЬКОФФ БАНК" Москва, 123060, 1-й Волоколамский проезд, д. 10,
          стр. 1
        </p>
        <p>БИК 044525974</p>
        <p>к/с: 30101810145250000974</p>
      </div>
    ),
    onOk() {},
  });
}
